function weatherForecastPart2 (input){

    let degrees = Number(input[0]);

//За да разберем дали въведените градуси са в еди кой си диапазон, трябва да направим проверка за всеки един с if - else if
//Условие градусите да са равни и по-големи на 26 и равни или по-малки от 35 за да изпише Hot.
    if(degrees>=26 && degrees<=35) // където && означава че и двете условия трябва да са изпълнени
    {
        result = "Hot";
    }
//Условие градусите да са равни и по-големи на 20.1 и равни или по-малки от 25.9 за да изпише Warm.
    else if(degrees>=20.1 && degrees<=25.9)
    {
        result = "Warm";
    }
//Условие градусите да са равни и по-големи на 15 и равни или по-малки от 20 за да изпише Mild.
    else if(degrees>=15 && degrees<=20)
    {
        result = "Mild";
    }
//Условие градусите да са равни и по-големи на 12 и равни или по-малки от 14.9 за да изпише Cool.
    else if(degrees>=12 && degrees<=14.9)
    {
        result = "Cool";
    }
//Условие градусите да са равни и по-големи на 5 и равни или по-малки от 11.9 за да изпише Cold.
    else if(degrees>=5 && degrees<=11.9)
    {
        result = "Cold";
    }
//Условие ако числото, което въведем не е във въведените диапазони на условията по-горе.
    else
    {
        result = "unknown";
    }
    console.log(result);
}
weatherForecastPart2(["50"])